#ifndef __MY_GARBAGE_DATA_H_
#define __MY_GARBAGE_DATA_H_


/******************************************************************************************
*                        @硬件实现层
******************************************************************************************/

/******************************************************************************************
*                        @软件抽象层
******************************************************************************************/

/******************************************************************************************
*                        @垃圾——数据结构
******************************************************************************************/ 
// 定义垃圾类型的枚举
typedef enum {
	HARMFUL_GARBAGE,	//有害垃圾
	FOOD_WASTE,			//厨余垃圾
	RECYCLABLE_GARBAGE,	//可回收垃圾
	OTHER_GARBAGE,		//其他垃圾
} GarbageType;

// 定义垃圾统计结构体
typedef struct {
    int harmful_garbage;    // 有害垃圾数量
    int food_garbage;         // 厨余垃圾数量
    int recyclable_garbage; // 可回收垃圾数量
    int other_garbage;      // 其他垃圾数量
} GarbageStatistics;


/******************************************************************************************
*                        @垃圾处理
******************************************************************************************/ 
void garbage_statistics_init(GarbageStatistics *stats);
void add_garbage(GarbageStatistics *stats, GarbageType type, int quantity);

#endif /* __MY_GARBAGE_DATA_H_ */
